// 1) რა არის Encoding და რატომ არ ითვლება უსაფრთხოების მეთოდად?

// Encoding არის მონაცემების ერთი ფორმატიდან მეორეში გადაყვანა, და შესაძლებელია მისი შენახვა 
// ან გაგზავნა. მაგალითად, Base64. Encoding უსაფრთხოების მეთოდად არ გამოიყენება
// რადგან მონაცემების თავდაპირველ ფორმაში დაბრუნება ნებისმიერს შეუძლია.

// 2) რა არის Encryption და რისთვის გამოიყენება?

// Encryption არის მონაცემთა გარადაქმნა რომლის წაკითხვაც არ შეგვიძლია, ამ მონაცმის decrypt მხოლოდ შესაბამისი გასაღების (Key) მქონე ადამიანს შეუძლია. გამოიყენება პირადი ინფორმაციის, ფაილებისა და ა.შ.

// 3) რა არის Hashing და რატომ გამოიყენება პაროლების შესანახად?

// Hashing არის მონაცემების გარდაქმნა ფიქსირებული სიგრძის მნიშვნელობად (Hash). Hashing გამოიყენება პაროლების შესანახად, რადგან საწყისი პაროლის აღდგენა პრაქტიკულად შეუძლებელია და მონაცემთა გაჟონვის შემთხვევაშიც პაროლი პირდაპირ არ ჩანს.

// 4) Encoding, Encryption და Hashing-ის შედარება

// Encoding:
// არ არის კარგი უსაფრთხოებისთვის
// reverse შეგვიძლია

// Encryption:
// კარგია უფასფრთხოებისთვის
// შესაძლებელია შემოატირალება თუ key გვაქვს


// Hashing:
// უნიკალური უსაფრთხოების შექმნა 
// არ იყენებს გასაღებს და თავისი ორიგინალურ ფორმას ვერ დაიბრუნებს

// 5) თითოეულის მთავარი მიზანი

// Encoding:
// მონაცემების წარმოდგენა ან გადაცემა მოსახერხებელ ფორმატში.

// Encryption:
// მონაცემების კონფიდენციალურობის დაცვა და არაავტორიზებული წვდომის თავიდან აცილება.

// Hashing:
// მონაცემების მთლიანობის შემოწმება და პაროლების უსაფრთხოდ შენახვა.