name ="Dachi"
#name არის ცვლადი
# = არის ცვლადისთვის მინიჭებული სიმბოლო
# "Dachi" არის ცვლადისთვის მნიშვნელობა
surname = "Dzagnidze"

print(name)
#პრინტ ფუნქციას გადაეცემა ეკრანზე გამოსატანი ობიეტი

#name ="Dachi" ეს არის str(string) ტიპის ცვლადი
#სტრინგი არის ბრჭყალებში მოქცეული სიმბოლოები
age = 14 #ეს არის int(integer) მთელი რიცხვი
height = 1.74 #ეს არის float არის (ათწილადი ტიპის ცვლადი)

know_proggraming = True #true or false Boolan ტიპის ცვლადი

print(name + " " + surname)

# age  გადაეცა type ფყნქციას რომელმაც დააბრუნა მისი ტიპი
# და დაბრუნებული ნებისმიერი სიმბოლო სიტყვა დავპრინტეთ რომელმაც გაგვაგებინა რომ
#print(type(age)) -ის ტიპი არის int(integer) - მთელი რიცხვი



